# Missing Data

In [4]:
import numpy as np
import pandas as pd

In [8]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}    ## np.nan indicates the missing values

In [9]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [16]:
df = pd.DataFrame(d)                                         ## pd.dataframe is used to convert a dictionary into dataframe

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.dropna()                             ## dropna removes the null values or missing values

     A    B  C
0  1.0  5.0  1

In [19]:
df.dropna(axis=1)                     ## dropna with axis = 1 removes thenull values from the columns

   C
0  1
1  2
2  3

In [20]:
df.dropna(thresh = 2)               ## thresh = 2 indicates that if a row has 2 non NA values it will display it too

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df.fillna(value = "Fill Value")  ## fillna is used to fill the null values

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [24]:
df['A'].fillna(value = df['A'].mean())              ## this is used to fill the null values with mean in column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [25]:
df['A'].fillna(value = df['A'].median())           ## here we have replaced null values woth the median in column B

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [26]:
df.fillna(value = df.mean())                       ## here we have replaced all the num value by mean

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3